# Based on the output of `brew bundle dump` (which must be run outside of tmux).
#

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'tavianator/tap'

# General packages.
brew 'abook'
brew 'ack'
brew 'asciidoctor'
brew 'astyle'
brew 'autoconf'
brew 'automake'
brew 'clang-format'
brew 'cmake'
brew 'coreutils'
brew 'cppcheck'
brew 'cscope'
brew 'ctags'
brew 'elinks'
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'fswatch'
brew 'gcc'
brew 'gettext'
brew 'git', args: ['with-pcre']
brew 'glib'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnupg'
brew 'gnupg2'
brew 'gnutls'
brew 'gpg-agent'
brew 'graphviz'
brew 'icdiff'
brew 'imagemagick'
brew 'imapfilter'
brew 'isync', args: ['with-berkeley-db']
brew 'jpeg'
brew 'json-c'
brew 'lbdb'
brew 'less'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libksba'
brew 'libmpc'
brew 'libpng'
brew 'librsvg'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libusb'
brew 'libusb-compat'
brew 'libuv'
brew 'libvo-aacenc'
brew 'libvterm'
brew 'libyaml'
brew 'links'
brew 'lockrun'
brew 'lua'
brew 'macvim'
brew 'makedepend'
brew 'mobile-shell'
brew 'msmtp'
brew 'mutt'
brew 'neovim'
brew 'node'
brew 'notmuch'
brew 'openssl'
brew 'pandoc'
brew 'pass'
brew 'plantuml'
brew 'python'
brew 'python3'
brew 'qemu'
brew 'qt'
brew 'r'
brew 'ranger'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'sqlite'
brew 'task'
brew 'terminal-notifier'
brew 'tmux' #, args: ['HEAD']
brew 'tree'
brew 'unar'
brew 'urlview'
brew 'vim'
brew 'weechat'
brew 'wget'
brew 'xz'
brew 'zsh'

# General applications

cask 'blender'
cask 'google-chrome'
cask 'iterm2-nightly'
cask 'java8'
cask 'karabiner-elements'
cask 'mactex'
cask 'onedrive'
cask 'sketchup'
cask 'skype'
cask 'teamviewer'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-meslo-for-powerline'

